Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase.Modify Method
 Modifies an analysis design parameter at the database. Inserts if parameter does not exist.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract void Modify()
Public MustOverride Sub Modify
See Also
Reference
AnalysisDesignParameterBase Class
Tekla.Structures.Analysis Namespace